BoumedineBillal/esp_ppq_lut/test_yolo/firmware/sdkconfig.defaults.esp32p4
# YOLO26n Validation - ESP32-P4
    CONFIG_IDF_TARGET="esp32p4"
    CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
    CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
    CONFIG_PARTITION_TABLE_CUSTOM=y
    CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
    CONFIG_SPIRAM=y
    CONFIG_SPIRAM_SPEED_200M=y
    CONFIG_CACHE_L2_CACHE_256KB=y
    CONFIG_CACHE_L2_CACHE_LINE_128B=y
    CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n
    CONFIG_ESP_INT_WDT=n
    CONFIG_ESP_TASK_WDT_EN=n
    CONFIG_IDF_EXPERIMENTAL_FEATURES=y
    